saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.ADuCM302x_DFP.3.2.0.pdsc
    <condition id="ADuCM3027">
      <description>ADuCM3027 device</description>
      <require Dvendor="Analog Devices:1"/>
      <accept Dname="ADuCM3027"/>
    </condition>
    <condition id="ADuCM3029">
      <description>ADuCM3029 device</description>
      <require Dvendor="Analog Devices:1"/>
      <accept Dname="ADuCM3029"/>
    </condition>
    <condition id="ADuCM302x CompilerIO">
      <description>ADuCM302x Compiler I/O requirements</description>
      <require condition="ADuCM302x"/>
      <require condition="ARMCC"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="UART"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
      <require Cclass="Compiler" Cgroup="I/O" Csub="STDOUT" Cvariant="User"/>
      <require Cclass="Compiler" Cgroup="I/O" Csub="STDERR" Cvariant="User"/>
      <require Cclass="Compiler" Cgroup="I/O" Csub="STDIN"  Cvariant="User"/>
      <require Cclass="Compiler" Cgroup="I/O" Csub="TTY"    Cvariant="User"/>
    </condition>
    <condition id="ADuCM302x Examples Support">
      <description>ADuCM302x Examples Support requirements</description>
      <require condition="ADuCM302x"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="WDT"/>
    </condition>
    <condition id="ADuCM302x Driver">
      <description>Common ADuCM302x driver requirements</description>
      <require condition="ADuCM302x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Global Configuration"/>
    </condition>
    <condition id="ADuCM302x Cycle Count">
      <description>ADuCM302x Cycle Count requirements</description>
      <require condition="ADuCM302x"/>
    </condition>
    <condition id="ADuCM302x ADC">
      <description>ADuCM302x ADC driver requirements</description>
      <require condition="ADuCM302x Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM302x BEEP">
      <description>ADuCM302x BEEP driver requirements</description>
      <require condition="ADuCM302x Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM302x Crypto">
      <description>ADuCM302x Crypto driver requirements</description>
      <require condition="ADuCM302x Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM302x Flash">
      <description>ADuCM302x Flash driver requirements</description>
      <require condition="ADuCM302x Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM302x I2C">
      <description>ADuCM302x I2C driver requirements</description>
      <require condition="ADuCM302x Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM302x SPI">
      <description>ADuCM302x SPI driver requirements</description>
      <require condition="ADuCM302x Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM302x SPORT">
      <description>ADuCM302x SPORT driver requirements</description>
      <require condition="ADuCM302x Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM302x UART">
      <description>ADuCM302x UART driver requirements</description>
      <require condition="ADuCM302x Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM302x_ARM">
      <description>ADuCM302x ARM (Keil) </description>
      <require condition="ADuCM302x"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="ADuCM3027_ARM">
      <description>ADuCM3027 ARM (Keil) </description>
      <require condition="ADuCM3027"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="ADuCM3029_ARM">
      <description>ADuCM3029 ARM (Keil) </description>
      <require condition="ADuCM3029"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="ADuCM302x_GCC">
      <description>ADuCM302x GCC</description>
      <require condition="ADuCM302x"/>
      <require condition="GCC"/>
    </condition>
    <condition id="ADuCM3027_GCC">
      <description>ADuCM3027 GCC</description>
      <require condition="ADuCM3027"/>
      <require condition="GCC"/>
    </condition>
    <condition id="ADuCM3029_GCC">
      <description>ADuCM3029 GCC</description>
      <require condition="ADuCM3029"/>
      <require condition="GCC"/>
    </condition>
    <condition id="ADuCM302x_IAR">
      <description>ADuCM3029 GCC</description>
      <require condition="ADuCM302x"/>
      <require condition="IAR"/>
    </condition>
    <condition id="ADuCM3027_IAR">
      <description>ADuCM3029 GCC</description>
      <require condition="ADuCM3027"/>
      <require condition="IAR"/>
    </condition>
    <condition id="ADuCM3029_IAR">
      <description>ADuCM3029 GCC</description>
      <require condition="ADuCM3029"/>
      <require condition="IAR"/>
    </condition>
  </conditions>

  <taxonomy>
    <description Cclass="Device" Cgroup="Drivers" doc="Documents/html/index.html">Analog Devices driver components for ADuCM302x devices</description>
  </taxonomy>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>System Startup for ADuCM302x</description>
      <files>
        <!-- additional include path -->
        <file category="include" name="Include/"/>
        <!-- startup files -->
        <file category="source" name="Source/ARM/startup_ADuCM3029.s" version="3.2.0" attr="config" condition="ADuCM3029_ARM"/>
        <file category="source" name="Source/GCC/startup_ADuCM3029.c" version="3.2.0" attr="config" condition="ADuCM3029_GCC"/>
        <file category="source" name="Source/GCC/reset_ADuCM3029.S"   version="3.2.0" attr="config" condition="ADuCM3029_GCC"/>
        <file category="source" name="Source/IAR/startup_ADuCM3029.s" version="3.2.0" attr="config" condition="ADuCM3029_IAR"/>
        <!-- system files -->
        <file category="source" name="Source/system_ADuCM3029.c" version="3.2.0" attr="config" condition="ADuCM3029"/>
        <!-- linker scripts -->
        <file category="linkerScript" name="Source/GCC/ADuCM3029.ld" version="3.2.0" attr="config" condition="ADuCM3029_GCC"/>
      </files>
    </component>

