saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.ADuCM302x_DFP.3.2.0.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="Power" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>System Clock and Power Management</description>
      <files>
        <file category="source" name="Source/drivers/pwr/adi_pwr.c"/>
        <file category="header" name="Include/drivers/pwr/adi_pwr.h"/>
        <file category="header" name="Include/config/adi_pwr_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___power___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="RNG" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>Random Number Generator</description>
      <files>
        <file category="source" name="Source/drivers/rng/adi_rng.c"/>
        <file category="header" name="Include/drivers/rng/adi_rng.h"/>
        <file category="header" name="Include/config/adi_rng_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___r_n_g___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="RTC" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>RTC</description>
      <files>
        <file category="source" name="Source/drivers/rtc/adi_rtc.c"/>
        <file category="header" name="Include/drivers/rtc/adi_rtc.h"/>
        <file category="header" name="Include/config/adi_rtc_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___r_t_c___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="3.2.0" condition="ADuCM302x SPI">
      <description>SPI</description>
      <files>
        <file category="source" name="Source/drivers/spi/adi_spi.c"/>
        <file category="header" name="Include/drivers/spi/adi_spi.h"/>
        <file category="header" name="Include/config/adi_spi_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___s_p_i___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="SPORT" Cversion="3.2.0" condition="ADuCM302x SPORT">
      <description>SPORT</description>
      <files>
        <file category="source" name="Source/drivers/sport/adi_sport.c"/>
        <file category="header" name="Include/drivers/sport/adi_sport.h"/>
        <file category="header" name="Include/config/adi_sport_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___s_p_o_r_t___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="TMR" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>GP Timer</description>
      <files>
        <file category="source" name="Source/drivers/tmr/adi_tmr.c"/>
        <file category="header" name="Include/drivers/tmr/adi_tmr.h"/>
        <file category="header" name="Include/config/adi_tmr_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___t_m_r___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="UART" Cversion="3.2.0" condition="ADuCM302x UART">
      <description>UART</description>
      <files>
        <file category="source" name="Source/drivers/uart/adi_uart.c"/>
        <file category="header" name="Include/drivers/uart/adi_uart.h"/>
        <file category="header" name="Include/config/adi_uart_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___u_a_r_t___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>WDT</description>
      <files>
        <file category="source" name="Source/drivers/wdt/adi_wdt.c"/>
        <file category="header" name="Include/drivers/wdt/adi_wdt.h"/>
        <file category="header" name="Include/config/adi_wdt_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___w_d_t___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="Interrupt" Cversion="3.2.0" condition="ADuCM302x Driver">
      <description>External Interrupt</description>
      <files>
        <file category="source" name="Source/drivers/xint/adi_xint.c"/>
        <file category="header" name="Include/drivers/xint/adi_xint.h"/>
        <file category="doc" name="Documents/html/group___x_i_n_t___driver.html"/>
      </files>
    </component>

  </components>

  <examples>

    <example name="HelloWorld" doc="ADuCM302x/Readme_HelloWorld.txt" folder="Boards/ADuCM3029-EZ-KIT/Examples/hello_world" version="3.2.0">
      <description>Hello World</description>
      <board name="ADuCM3029 EZ-KIT" vendor="AnalogDevices" Dname="ADuCM302x"/>
        <project>
            <environment name="uv" load="ADuCM302x/keil/HelloWorld.uvprojx"/>
            <environment name="cces" load="ADuCM302x/cces/.project"/>
            <environment name="iar" load="ADuCM302x/iar/HelloWorld.ewp"/>
        </project>
        <attributes>
            <category>Getting Started</category>
            <component Cclass="CMSIS"  Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="Retarget"/>
            <component Cclass="Device" Cgroup="Examples Support" />
        </attributes>
    </example>

  </examples>
</package>
